Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/edc/PIC32MK0256GPG048.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f2" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f2" edc:nmmrflags="St" edc:nmmrid="1296" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f2" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f2" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f3" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f3" edc:nmmrflags="St" edc:nmmrid="1304" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f3" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f3" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f4" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f4" edc:nmmrflags="St" edc:nmmrid="1312" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f4" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f4" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f5" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f5" edc:nmmrflags="St" edc:nmmrid="1320" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f5" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f5" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f6" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f6" edc:nmmrflags="St" edc:nmmrid="1328" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f6" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f6" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f7" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f7" edc:nmmrflags="St" edc:nmmrid="1336" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f7" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f7" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f8" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f8" edc:nmmrflags="St" edc:nmmrid="1344" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f8" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f8" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f9" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f9" edc:nmmrflags="St" edc:nmmrid="1352" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f9" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f9" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f10" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f10" edc:nmmrflags="St" edc:nmmrid="1360" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f10" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f10" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
