Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/edc/PIC32MK0256GPG048.PIC
      <edc:AdjustPoint edc:_addr="0x1F8103E0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x1F810410" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC45" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="IPC45" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810420" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC46" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC46" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810430" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:offset="0xA0"/>
      <edc:SFRDef edc:_addr="0x1F8104D0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="-----------nnnnn----------------" edc:cname="IPC57" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000----------------" edc:name="IPC57" edc:nzwidth="32" edc:por="-----------00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="SBIS" edc:desc="" edc:mask="0x3" edc:name="SBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SBIP" edc:desc="" edc:mask="0x7" edc:name="SBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8104E0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F8104F0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC59" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu----------------" edc:name="IPC59" edc:nzwidth="32" edc:por="---xxxxx---xxxxx----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="PWM7IS" edc:mask="0x3" edc:name="PWM7IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM7IP" edc:mask="0x7" edc:name="PWM7IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM8IS" edc:mask="0x3" edc:name="PWM8IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM8IP" edc:mask="0x7" edc:name="PWM8IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810500" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="IPC60" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="IPC60" edc:nzwidth="32" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWM9IS" edc:mask="0x3" edc:name="PWM9IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM9IP" edc:mask="0x7" edc:name="PWM9IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810510" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_GP_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC61" edc:impl="0xffffffe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---00000---00000--------" edc:name="IPC61" edc:nzwidth="32" edc:por="---xxxxx---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PCACHEIS" edc:desc="PCACHE Interrupt Sub-Priority" edc:mask="0x3" edc:name="PCACHEIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PCACHEIP" edc:desc="PCACHE Interrupt Priority" edc:mask="0x7" edc:name="PCACHEIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
